// Написать программу вычисления произведения чисел от 1 до N   
Console.WriteLine("Hello, World!");
